tap "homebrew/bundle"
tap "oven-sh/bun"
tap "wix/brew"
brew "bat"
brew "git"
brew "node"
brew "pnpm"
brew "poppler"
brew "watchman"
brew "yarn"
brew "oven-sh/bun/bun"
brew "wix/brew/applesimutils"
cask "fig"
cask "raycast"
cask "visual-studio-code"
cask "warp"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fayras.simple-new-file"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "heron.firefox-devtools-theme"
vscode "philnash.ngrok-for-vscode"
vscode "planbcoding.vscode-react-refactor"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "withfig.fig"
vscode "yoavbls.pretty-ts-errors"
