tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "kamillobinski/thock"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "wix/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Modern, maintained replacement for ls
brew "eza"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AI coding agent, built for the terminal
brew "opencode"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Thock your mac keyboard
brew "kamillobinski/thock/thock"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# File manager
cask "bloom"
# Terminal-based AI coding assistant
cask "claude-code"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Menu bar manager
cask "jordanbaird-ice"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
vscode "andenetalexander.vim-cheatsheet"
vscode "anotherglitchinthematrix.monochrome"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "austenc.tailwind-docs"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "chausen.hacker-blue"
vscode "cherrera1208.cherr-custom-sepia-theme"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fayras.simple-new-file"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "heron.firefox-devtools-theme"
vscode "humao.rest-client"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "jovejonovski.ocean-green"
vscode "krueger71.crt-themes"
vscode "mechatroner.rainbow-csv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-less"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-speech"
vscode "patbenatar.advanced-new-file"
vscode "philnash.ngrok-for-vscode"
vscode "phoenisx.cssvar"
vscode "planbcoding.vscode-react-refactor"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "shadesofbuntu.flexoki-light"
vscode "tgosystems.togglebracketguides"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vstirbu.vscode-mermaid-preview"
vscode "withfig.fig"
vscode "wk-j.vscode-httpie"
vscode "yoavbls.pretty-ts-errors"
npm "@musistudio/claude-code-router"
npm "typescript"
